---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkedFileStatus.CanBeUpgraded
enum: Autodesk.Revit.DB.LinkedFileStatus
source: html/410b48f8-2a32-3d54-492c-c9a9fe4030ca.htm
---
# Autodesk.Revit.DB.LinkedFileStatus.CanBeUpgraded

The linked point cloud file is obsolete and can be indexed into new format.